[
  {
    "id": 1,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Family Life In Missions",
    "description": "The challenges facing the Christian family today are many, and the enemy is attempting to ‘redefine’ what marriage really means. This workshop addresses difficult times faced by believers, ministers, and missionaries and the negative tolls they take on their callings.",
    "facilitators": ["Rev. Isaiah Olukanni", "Prof. Kemi Okuwa"]
  },
  {
    "id": 2,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Prayer And Warfare Mobilization (Reaching The Nations On Our Knees)",
    "description": "This session will actively engage critical issues about our authority and dominion over darkness, the devil, and hordes of demons. The goal is to make your ministry explore spiritual mapping to conquer your territory for Christ.",
    "facilitators": ["Pastor Kayode Ojo", "Rev. Jerry Odewole"]
  },
  {
    "id": 3,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Core Preparation For The Missions Field",
    "description": "This session equips, inspires, and releases you to share the Gospel with confidence, challenging you from apathy or inadequacy to gospel activity. It's designed to help train your congregation to be more effective members of the local church and provide strategies to reach your community.",
    "facilitators": ["Dr. Gbenga Oyedapo", "Rev. Gbenga Balogun"]
  },
  {
    "id": 4,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Discipleship: A Core Responsibility Of The Local Church",
    "description": "This session strongly illuminates the central purposes of the church to train its members to minister effectively to one another, to their communities, and ultimately to the world in God’s mission. You'll find out how to turn your world 'upside up' as a vibrant incubator for reproducing disciples of Jesus.",
    "facilitators": ["Dr. Richard Olaniyi", "Pastor Bunmi John"]
  },
  {
    "id": 5,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Connect Influencers And Curing The Failure Of Revivals",
    "description": "This session explores why revivals seem to fail and why key influencers in society aren't being converted. It examines historical examples and modern strategies for connecting with and converting influencers in various spheres of society, from technology to the arts.",
    "facilitators": ["Dr. Kunle Ogunkolati", "Pastor Seun Banjo"]
  },
  {
    "id": 6,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "God’s Work Advances On The Wings Of Intercession",
    "description": "This session explores the ministry and power of intercession, defining an intercessor as a selfless person who takes on the burdens of others. It covers how to develop an intercession burden, the effects of intercessory prayers, and the dangers a missionary faces without the backing of intercessors.",
    "facilitators": ["Pastor Tunde Ajayi", "Rev. Samuel Adedeji"]
  },
  {
    "id": 7,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Good Health In A World With Disease",
    "description": "This session addresses how to cope with global health challenges like pandemics and outbreaks. It covers preventive measures, appropriate responses during health crises, the importance of good food and water, and attention to the earliest symptoms of sicknesses, empowering participants to impact and save lives through medical outreaches.",
    "facilitators": ["Dr. Femi-Israel Oyewale", "Dr. Ola Olumofin"]
  },
  {
    "id": 8,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Parenting Godly Gen Zs And Gen As In Missions",
    "description": "This session delves into the characteristics of Generation Z and Alpha, the first generation to grow up with pervasive digital technology. It provides guidance on how to parent these generations to become great tools in the hands of the Lord.",
    "facilitators": ["Missionary Toyin Ijagbemi-Eni", "Sis. Toyin Ajayi"]
  },
  {
    "id": 9,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Wisdom Media & Missions Mobilization",
    "description": "This session focuses on leveraging technology to advance God’s mission, particularly in a world with rapid changes and lockdowns. It provides ideas and tips for communication leaders, pastors, and individuals to grow their donor base, raise support, and improve their online ministry.",
    "facilitators": ["Bro. ‘Diipo Abidoye", "Bro. Iyinoluwa Adedokun"]
  },
  {
    "id": 10,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Urban Missions: Evangelistic Strategies For Cities",
    "description": "This session provides appropriate evangelistic strategies for effective outreach in urban settings, considering the heterogeneous situations of age, race, language, profession, custom, and culture. It addresses the concentration of populations in cities, internally displaced persons, and global migration phenomena.",
    "facilitators": ["Rev. Joseph Folarin", "Barnabas Afolabi"]
  },
  {
    "id": 11,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Short-Term Missions",
    "description": "Gain insight and training to do short-term missions with excellence, whether sending, going, or receiving. The session covers practical, mental, spiritual, and physical preparations, as well as topics like gender issues, discipleship ministry, and race, ethnicity, and culture.",
    "facilitators": ["Elisha Folaranmi", "Pastor Emmaneul Oworu"]
  },
  {
    "id": 12,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Training In Missions And Ministry",
    "description": "This session focuses on building a skilled and qualified missionary task force with proper orientation, development, and oversight. It covers developing workers, crisis and trauma training, conflict resolution, retention, supportive care, and language learning.",
    "facilitators": ["Rev. Daniel Appiah", "Pastor Yinka Jemilawon"]
  },
  {
    "id": 13,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Member Care And Personnel Development",
    "description": "This session promotes healthy organizations and relationships in members’ personal, corporate, and spiritual lives. It covers holistic member care strategies, emotional and spiritual support, burnout prevention, team dynamics, and resilience-building for long-term ministry.",
    "facilitators": ["Pastor Gboyega Olusola", "Pastor Gbenga Ogunshola"]
  },
  {
    "id": 14,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Vibrant Youths For Missions Mobilization",
    "description": "This session is about empowering youth like David, Daniel, and Joseph to live self-sacrificing lives and feel that they belong and their contributions matter. It seeks a Bible-centered, Christ-exalting, and church-based plan for youth to accept the challenge of missions.",
    "facilitators": ["Bro. Ben Omoruyi", "Bro Israel Oladapo"]
  },
  {
    "id": 15,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Women Of Africa As Risk Takers For Almighty God",
    "description": "This session recognizes the potentials, talents, capacity, and opportunities for women in ministry and missions. It highlights biblical and contemporary impactful women models and the attributes of fearless ambassadors of the living God.",
    "facilitators": ["Sis. Folashade Ogunkolati", "Sis. Oluwakemi Appiah"]
  },
  {
    "id": 16,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Changing A Nation By Changing The Campuses",
    "description": "This session addresses the great loss of a ministry without student ministry and mission. It focuses on engaging students, who are the national leaders of tomorrow, to deny the occult of a harvest and get acquainted with historical missionary figures.",
    "facilitators": ["Dr. Sam Esosa", "Bro. Adedokun Emmanuel"]
  },
  {
    "id": 17,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Urban Missions Among The Poor",
    "description": "This session explores the characteristics of the urban poor, their potentials when converted, and strategies to mobilize them for effective ministry. It focuses on leadership development and bringing the poor from dependency to dignity.",
    "facilitators": ["Rev Sam Adeola", "Pastor Segun Olaseinde"]
  },
  {
    "id": 18,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Strategic Evangelistic Drive Among Professionals",
    "description": "This session aims to cure the failure of revivals by occupying the cultural mountains of our world systems and winning the critical mass of influencers. It uses examples like Gamaliel and Cornelius to equip professionals with the gifts of the Holy Spirit.",
    "facilitators": ["Pastor Sola Mene", "Pastor Dickson Odogiyon"]
  },
  {
    "id": 19,
    "imageURL": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1350&q=80",
    "title": "Financial Leadership In Missions And Ministry",
    "description": "This session helps advance your knowledge and ability to meet ever-changing strategic and financial issues affecting your organization. It covers financial management, compliance, risk management, supporting organizational goals, and best practices for non-profit financial reporting.",
    "facilitators": ["Pastor Oluronbi Israel", "Akano Adedokun"]
  }
]
