[
  {
    "id": 1,
    "url": "https://www.youtube.com/embed/G2sX-WV6SDI",
    "title": "Plenary 1",
    "description": "Rev. Apiah Daniel steps up with a raw, urgent message: God’s heart aches for the 2 billion people who’ve never heard of Jesus. He weaves personal stories with God’s relentless love for every tribe and tongue. You’re not just a bystander; you’re tied to Abraham’s promise to bless the nations. Through five bold steps—passion, sacrifice, focus, prayer, and gutsy choices—he pushes you to stop sitting pretty and start carrying the gospel’s light, even to the nations right in your city. It’s a challenge to live bigger than yourself.",
    "speaker": "Rev. Apiah Daniel"
  },
  {
    "id": 2,
    "url": "https://www.youtube.com/embed/tlnANVAj1Ds",
    "title": "Plenary 2",
    "description": "Rev. Rueben Ezemadu grabs you by the shoulders with a message that stings and inspires: the world’s still shrouded in darkness, and God’s counting on you to carry His light. He digs into Genesis, showing how God spoke light into creation’s chaos, revealing Jesus as that light who scatters darkness (John 1:9). But here’s the kicker—you, the church, are the lightbearers meant to reflect Him (Matthew 5:14-16). Too many Christians, like Noah’s descendants, chase their own towers of comfort instead of God’s mission to fill the earth with His glory. With stories like Philip’s unexpected journey to Samaria and the Ethiopian eunuch, he pleads for flexibility to the Holy Spirit’s leading, urging you to ditch your plans and go where the need is greatest. Over 2 billion wait in darkness—don’t let your light stay hidden.",
    "speaker": "Rev. Reuben Ezemadu"
  },
  {
    "id": 3,
    "url": "https://www.youtube.com/embed/1e-3jGcvzHQ",
    "title": "Plenary 3",
    "description": "Pastor. David Ogunshola shakes you awake with a bold question: why isn’t the church transforming the world as fast as it should? He points to Revelation 11:15, where the kingdoms of this world become God’s, and challenges our narrow focus on salvation over dominion. God didn’t create the earth just to save it—He meant for us to rule it as His representatives, shaping culture through the seven mountains of influence: business, arts, media, government, education, family, and religion. We’ve been stuck in “primary three” thinking, chasing geographical missions while ignoring the centers of power that shape lives—like who designs your phone or sets school curriculums. Ogunshola urges a mindset shift: stop hiding in church, waiting for rapture, and start deploying saved, discipled believers to the top of these mountains with wisdom, wealth, influence, and power. It’s time to see these domains as mission fields and train kings, not tenants, to carry God’s light where it’s darkest.",
    "speaker": "Pst. David Ogunshola"
  },
  {
    "id": 4,
    "url": "https://www.youtube.com/embed/mJKTKJQ0yI0",
    "title": "Plenary 4",
    "description": "Dr. Kunle Ogunkolati ignites a fire with a passionate call to make nations God’s inheritance. Centering on Isaiah 49:6, he declares that God’s mission isn’t small—it’s to bring Christ’s light to every nation, not just local communities or people groups. Nations are God’s masterpiece, the heart of His redemptive plan, created to seek and serve Him (Acts 17:26-27). Ogunkolati challenges the church to stop hiding its light and go where Christ isn’t known, accepted, or revered. He introduces strategic mission concepts: gateway nations (like Singapore for Asia), getaway nations (open-door countries for easy outreach), groundway nations (like Nigeria, equipped to send missionaries), groupway nations (aligned for collective evangelism), grantway nations (funding vulnerable mission fields), guardway nations (breaking spiritual barriers in restricted areas), and glideway nations (using analytics to target mission efforts). He urges believers to pray, give, and go, committing resources and lives to make Christ the center of every nation, ensuring darkness bows to God’s glory.",
    "speaker": "Dr. Kunle Ogunkolati"
  },
  {
    "id": 5,
    "url": "https://www.youtube.com/embed/G-KHDbGbSbg",
    "title": "Plenary 5",
    "description": "Dr. Isaac Apata delivers a fiery charge, urging believers to stop hiding and shine as God’s light in a dark world. Drawing from Isaiah 49:6, he emphasizes that God has made you a light to the nations, not to sit comfortably in church but to bring salvation globally. He likens the church to prisoners in Plato’s cave, mistaking shadows for reality, and challenges the complacency that dims our light—fear of rejection, comfort zone Christianity, compromise, and ignorance of God’s mission. Dr. Apata stresses that you are either light or darkness; there’s no middle ground. Referencing Matthew 5:14-16, he declares you are the light, meant to shine through character, compassion, and bold sharing of the gospel. He points to the seven mountains of influence—religion, family, education, government, media, arts, and business—urging believers to infiltrate these spheres with Christ’s light. With 4 billion still in darkness and only 15,000 missionaries reaching 3.35 billion unreached people, he calls for action: start where you are, drop struggles, and launch out to nations like Afghanistan, not just comfortable places like Canada.",
    "speaker": "Dr. Isaac Apata"
  }
]

